InformationRegisters/усд_ПраваПодписиНаЭтапахМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>усд_ПраваПодписиНаЭтапахМаршрутов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_МаршрутыДвиженияДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_ГруппыСогласованияДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_ЭтапыМаршрутовДвиженияДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/усд_АдресацияЗадачНаЭтапахМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>усд_АдресацияЗадачНаЭтапахМаршрутов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_ГруппыСогласованияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_МаршрутыДвиженияДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_ЭтапыМаршрутовДвиженияДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/усд_СоставГруппСогласованияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>усд_СоставГруппСогласованияДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ГруппаСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.усд_ГруппыСогласованияДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/усд_ПраваПодписиНаЭтапахМаршрутов/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	Если НЕ фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ФормироватьЗадачиПоИсполнителямСогласования") Тогда
		Возврат;
	КонецЕсли;
	Если ЭтотОбъект.Количество()=0 Тогда
		СтруктураОтбор = Новый Структура;
		Для Каждого ЭлементОтбора Из ЭтотОбъект.Отбор Цикл
			Если ЭлементОтбора.Использование И ЭлементОтбора.Имя<>"Пользователь" Тогда
				СтруктураОтбор.Вставить(ЭлементОтбора.Имя,ЭлементОтбора.Значение);
			КонецЕсли;
		КонецЦикла;
		Если СтруктураОтбор.Количество()>0 Тогда
			НаборЗаписей = РегистрыСведений.усд_АдресацияЗадачНаЭтапахМаршрутов.СоздатьНаборЗаписей();
			Для Каждого ЭлементОтбора Из СтруктураОтбор Цикл
				НаборЗаписей.Отбор[ЭлементОтбора.Ключ].Установить(ЭлементОтбора.Значение);
			КонецЦикла;
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			Попытка
				НаборЗаписей.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При записи сведений о правах подписи не удалось обновить сведения об адресации задач по согласованию!");
			КонецПопытки;
		КонецЕсли;
	Иначе
		СтрокиФильтра = ЭтотОбъект.Выгрузить(,"Маршрут,ВидДокументов,Этап");
		СтрокиФильтра.Свернуть("Маршрут,ВидДокументов,Этап");
		СтруктураОтбор = Новый Структура("Маршрут,ВидДокументов,Этап");
		СписокГрупп = Новый Массив;
		Выгрузка = ЭтотОбъект.Выгрузить();
		Для Каждого СтрокаЗапись Из Выгрузка Цикл
			Если ЗначениеЗаполнено(СтрокаЗапись.Пользователь) И ТипЗнч(СтрокаЗапись.Пользователь)=Тип("СправочникСсылка.усд_ГруппыСогласованияДокументов") Тогда
				СписокГрупп.Добавить(СтрокаЗапись.Пользователь);
			КонецЕсли;
		КонецЦикла;
		Если СписокГрупп.Количество()>0 Тогда

			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СоставГруппСогласованияДокументов.Пользователь,
				|	СоставГруппСогласованияДокументов.ГруппаСогласования
				|ИЗ
				|	РегистрСведений.усд_СоставГруппСогласованияДокументов КАК СоставГруппСогласованияДокументов
				|ГДЕ
				|	СоставГруппСогласованияДокументов.ГруппаСогласования В(&ГруппаСогласования)";

			Запрос.УстановитьПараметр("ГруппаСогласования", СписокГрупп);

			Результат = Запрос.Выполнить();

			СоставГрупп = Результат.Выгрузить();
		КонецЕсли;
		Для Каждого СтрокаФильтра Из СтрокиФильтра Цикл
			ЗаполнитьЗначенияСвойств(СтруктураОтбор,СтрокаФильтра);
			НаборЗаписей = РегистрыСведений.усд_АдресацияЗадачНаЭтапахМаршрутов.СоздатьНаборЗаписей();
			Для Каждого ЭлементОтбора Из СтруктураОтбор Цикл
				НаборЗаписей.Отбор[ЭлементОтбора.Ключ].Установить(ЭлементОтбора.Значение);
			КонецЦикла;
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			СтрокиКДобавлению = Выгрузка.НайтиСтроки(СтруктураОтбор);
			ДобавленныеПользователи = Новый Массив;
			Для Каждого СтрокаДобавить Из СтрокиКДобавлению Цикл
				Если Не ЗначениеЗаполнено(СтрокаДобавить.Пользователь) Тогда
					Продолжить;
				КонецЕсли;
				Если ТипЗнч(СтрокаДобавить.Пользователь)=Тип("СправочникСсылка.Пользователи") Тогда
					Если ДобавленныеПользователи.Найти(СтрокаДобавить.Пользователь)=Неопределено Тогда
						НоваяСтрока = НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураОтбор);
						НоваяСтрока.Пользователь = СтрокаДобавить.Пользователь;
						ДобавленныеПользователи.Добавить(СтрокаДобавить.Пользователь);
					КонецЕсли;
				Иначе
					СтрокиСоставГруппы = СоставГрупп.НайтиСтроки(Новый Структура("ГруппаСогласования",СтрокаДобавить.Пользователь));
					Для Каждого СтрокаСоставаГруппы Из СтрокиСоставГруппы Цикл
						Если Не ЗначениеЗаполнено(СтрокаСоставаГруппы.Пользователь) Тогда
							Продолжить;
						КонецЕсли;
						Если ДобавленныеПользователи.Найти(СтрокаСоставаГруппы.Пользователь)=Неопределено Тогда
							НоваяСтрока = НаборЗаписей.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураОтбор);
							НоваяСтрока.Пользователь = СтрокаСоставаГруппы.Пользователь;
							НоваяСтрока.ГруппаСогласования = СтрокаДобавить.Пользователь;
							ДобавленныеПользователи.Добавить(СтрокаСоставаГруппы.Пользователь);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			Попытка
				НаборЗаписей.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При записи сведений о правах подписи не удалось обновить сведения об адресации задач по согласованию!");
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
